{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACCOUNT",
    "1": "B-EMAIL",
    "2": "B-ID",
    "3": "B-LOCATION",
    "4": "B-NATIONALITY",
    "5": "B-ORGANIZATION",
    "6": "B-PERSON",
    "7": "B-PHONE",
    "8": "I-DATE",
    "9": "I-NATIONALITY",
    "10": "I-ORGANIZATION",
    "11": "I-PERSON",
    "12": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNT": 0,
    "B-EMAIL": 1,
    "B-ID": 2,
    "B-LOCATION": 3,
    "B-NATIONALITY": 4,
    "B-ORGANIZATION": 5,
    "B-PERSON": 6,
    "B-PHONE": 7,
    "I-DATE": 8,
    "I-NATIONALITY": 9,
    "I-ORGANIZATION": 10,
    "I-PERSON": 11,
    "O": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
